{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-TIME",
    "1": "I-MD5",
    "2": "I-location",
    "3": "I-URL",
    "4": "I-FILEPATH",
    "5": "B-tools",
    "6": "B-MD5",
    "7": "I-Infrastucture",
    "8": "I-attack-pattern",
    "9": "I-identity",
    "10": "I-vulnerability",
    "11": "I-EMAIL",
    "12": "I-tools",
    "13": "B-threat-actor",
    "14": "I-TIME",
    "15": "B-malware",
    "16": "B-URL",
    "17": "B-SHA1",
    "18": "B-SOFTWARE",
    "19": "B-campaign",
    "20": "I-REGISTRYKEY",
    "21": "B-identity",
    "22": "I-SOFTWARE",
    "23": "B-Infrastucture",
    "24": "O",
    "25": "I-malware",
    "26": "I-DOMAIN",
    "27": "B-REGISTRYKEY",
    "28": "I-threat-actor",
    "29": "B-IPV4",
    "30": "B-DOMAIN",
    "31": "B-attack-pattern",
    "32": "I-campaign",
    "33": "I-IPV4",
    "34": "B-FILEPATH",
    "35": "B-SHA2",
    "36": "I-SHA2",
    "37": "B-location",
    "38": "I-SHA1",
    "39": "B-EMAIL",
    "40": "B-vulnerability"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-DOMAIN": 30,
    "B-EMAIL": 39,
    "B-FILEPATH": 34,
    "B-IPV4": 29,
    "B-Infrastucture": 23,
    "B-MD5": 6,
    "B-REGISTRYKEY": 27,
    "B-SHA1": 17,
    "B-SHA2": 35,
    "B-SOFTWARE": 18,
    "B-TIME": 0,
    "B-URL": 16,
    "B-attack-pattern": 31,
    "B-campaign": 19,
    "B-identity": 21,
    "B-location": 37,
    "B-malware": 15,
    "B-threat-actor": 13,
    "B-tools": 5,
    "B-vulnerability": 40,
    "I-DOMAIN": 26,
    "I-EMAIL": 11,
    "I-FILEPATH": 4,
    "I-IPV4": 33,
    "I-Infrastucture": 7,
    "I-MD5": 1,
    "I-REGISTRYKEY": 20,
    "I-SHA1": 38,
    "I-SHA2": 36,
    "I-SOFTWARE": 22,
    "I-TIME": 14,
    "I-URL": 3,
    "I-attack-pattern": 8,
    "I-campaign": 32,
    "I-identity": 9,
    "I-location": 2,
    "I-malware": 25,
    "I-threat-actor": 28,
    "I-tools": 12,
    "I-vulnerability": 10,
    "O": 24
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.30.2",
  "vocab_size": 30522
}
